src/cf/src/Reports/ABCАнализПродаж/ABCАнализПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ABCАнализПродаж</name>
</mdclass:Report>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеРасходы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Выручка</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ВаловаяПрибыль</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Reports/ABCАнализПродаж/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	/////////////////////////////////////////////////////////////////////////
	// параметры данных
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	ПарамА = ПараметрыДанных.Найти("AКласс");
	ПарамВ = ПараметрыДанных.Найти("BКласс");
	ПарамС = ПараметрыДанных.Найти("CКласс");
	/////////////////////////////////////////////////////////////////////////
	// настройки пользователя
	ПользовательПараметрыДанных = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	ПользПарамА = ПользовательПараметрыДанных.Найти(ПарамА.ИдентификаторПользовательскойНастройки);
	ПользПарамВ = ПользовательПараметрыДанных.Найти(ПарамВ.ИдентификаторПользовательскойНастройки);
	ПользПарамС = ПользовательПараметрыДанных.Найти(ПарамС.ИдентификаторПользовательскойНастройки);
	Если ПользПарамА.Значение + ПользПарамВ.Значение + ПользПарамС.Значение <> 100 Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сумма процентов распределения по классам АВС должна быть равно 100%";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПериодОтчета = Настройки.ПараметрыДанных.Элементы.Найти(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	ТЗКоэфОб = ПолучитьТЗКоэфОб(ПериодОтчета.ДатаНачала,ПериодОтчета.ДатаОкончания);
	
	//ЗначениеПараметра = Настройки.ПараметрыДанных.Найти3начениеПараметра(Новый ПараметрКомпоновкиДанных("ТЗКоэфОб"));
	//Если НЕ ЗначениеПараметра = Неопределено Тогда
	//	ЗначениеПараметра.Использование  = Истина;
	//	ЗначениеПараметра.Значение  = ТЗКоэфОб; 
	//КонецЕсли;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, Новый Структура("ТЗКоэфОб",ТЗКоэфОб), ДанныеРасшифровки, Истина);	
	ДокументРезультат.Очистить();	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
КонецПроцедуры

Функция Получить_ТЗ_Дни(НачПериода,КонПериода)
	//НачПериода = НачалоДня('20180301'); // 1 марта 2018
	//КонПериода = НачалоДня('20180331'); // 31 марта 2018
    
    ТЗ_Дни = Новый ТаблицаЗначений;
    ТЗ_Дни.Колонки.Добавить("День",Новый ОписаниеТипов("Дата"));
    ДеньСчетчик = НачПериода;

    Пока ДеньСчетчик <= КонПериода Цикл
        НовСтрока = ТЗ_Дни.Добавить();
        НовСтрока.День = ДеньСчетчик;
 		Если ДеньСчетчик = КонПериода Тогда 
			Прервать;
		КонецЕсли;
       ДеньСчетчик = Мин(НачалоНедели(ДеньСчетчик + 7*24*3600),КонПериода);
    КонецЦикла;    
    Возврат ТЗ_Дни;
КонецФункции

Функция ПолучитьТЗКоэфОб(НачПериода,КонПериода)
	//НачПериода = НачалоДня('20180301'); // 1 марта 2018
	//КонПериода = НачалоДня('20180331'); // 31 марта 2018
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	ТЗ_Дни.День КАК День
        |ПОМЕСТИТЬ ВТ_Дни
        |ИЗ
        |	&ТЗ_Дни КАК ТЗ_Дни
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	СебестоимостьТоваровОстаткиИОбороты.Номенклатура КАК Номенклатура,
        |	ВТ_Дни.День КАК ДатаДень,
        |	СУММА(ВЫБОР
        |			КОГДА СебестоимостьТоваровОстаткиИОбороты.Период = &НачПериода
        |					И ВТ_Дни.День = &НачПериода
        |				ТОГДА СебестоимостьТоваровОстаткиИОбороты.СуммаНачальныйОстаток
        |			КОГДА СебестоимостьТоваровОстаткиИОбороты.Период = &НачПериода
        |				ТОГДА СебестоимостьТоваровОстаткиИОбороты.СуммаНачальныйОстаток + СебестоимостьТоваровОстаткиИОбороты.СуммаОборот
        |			ИНАЧЕ ВЫБОР
        |					КОГДА СебестоимостьТоваровОстаткиИОбороты.Период < ВТ_Дни.День
        |						ТОГДА СебестоимостьТоваровОстаткиИОбороты.СуммаОборот
        |					ИНАЧЕ 0
        |				КОНЕЦ
        |		КОНЕЦ) КАК НачОстатокДень,
        |	СУММА(ВЫБОР
        |			КОГДА СебестоимостьТоваровОстаткиИОбороты.Период = &НачПериода
        |				ТОГДА СебестоимостьТоваровОстаткиИОбороты.СуммаКонечныйОстаток
        |			КОГДА СебестоимостьТоваровОстаткиИОбороты.Период <= ВТ_Дни.День
        |				ТОГДА СебестоимостьТоваровОстаткиИОбороты.СуммаОборот
        |			ИНАЧЕ 0
        |		КОНЕЦ) КАК КонОстатокДень,
        |	СебестоимостьТоваровОстаткиИОбороты.Характеристика КАК Характеристика
        |ПОМЕСТИТЬ ВТ
        |ИЗ
        |	ВТ_Дни КАК ВТ_Дни
        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВНаличии.ОстаткиИОбороты(&НачПериода, &КонПериода, НЕДЕЛЯ, , ) КАК СебестоимостьТоваровОстаткиИОбороты
        |		ПО ВТ_Дни.День >= СебестоимостьТоваровОстаткиИОбороты.Период
        |
        |СГРУППИРОВАТЬ ПО
        |	СебестоимостьТоваровОстаткиИОбороты.Номенклатура,
        |	ВТ_Дни.День,
        |	СебестоимостьТоваровОстаткиИОбороты.Характеристика
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	ВТ.Номенклатура КАК Номенклатура,
        |	ВТ.Характеристика КАК Характеристика,
        |	СУММА(ВЫБОР
        |			КОГДА ВТ.ДатаДень = &НачПериода
        |				ТОГДА ВТ.НачОстатокДень / 2
        |			КОГДА ВТ.ДатаДень = &КонПериода
        |				ТОГДА ВТ.КонОстатокДень / 2
        |			ИНАЧЕ ВТ.КонОстатокДень
        |		КОНЕЦ) КАК Остаток,
        |	СУММА(1) КАК КоличествоПериодов
        |ПОМЕСТИТЬ ВТТоварооборот
        |ИЗ
        |	ВТ КАК ВТ
        |
        |СГРУППИРОВАТЬ ПО
        |	ВТ.Номенклатура,
        |	ВТ.Характеристика
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	ЕСТЬNULL(ПродажиОбороты.Номенклатура, ВТТоварооборот.Номенклатура) КАК Номенклатура,
        |	ЕСТЬNULL(ПродажиОбороты.Характеристика, ВТТоварооборот.Характеристика) КАК Характеристика,
        |	ВЫБОР
        |		КОГДА ЕСТЬNULL(ВТТоварооборот.Остаток, 0) = 0
        |			ТОГДА 0
        |		ИНАЧЕ (ПродажиОбороты.СебестоимостьОборот + ПродажиОбороты.ДополнительныеРасходыОборот) / (ВТТоварооборот.Остаток / (ВТТоварооборот.КоличествоПериодов - 2))
        |	КОНЕЦ КАК КоэфОб,
        |	ПродажиОбороты.СебестоимостьОборот КАК СебестоимостьОборот,
        |	ПродажиОбороты.ДополнительныеРасходыОборот КАК ДополнительныеРасходыОборот,
        |	ВТТоварооборот.Остаток КАК Остаток,
        |	ВТТоварооборот.КоличествоПериодов КАК КоличествоПериодов
        |ИЗ
        |	ВТТоварооборот КАК ВТТоварооборот
        |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(&НачПериода, &КонПериода, , ) КАК ПродажиОбороты
        |		ПО ВТТоварооборот.Номенклатура = ПродажиОбороты.Номенклатура
        |			И ВТТоварооборот.Характеристика = ПродажиОбороты.Характеристика";
        Запрос.УстановитьПараметр("НачПериода",НачПериода);
        Запрос.УстановитьПараметр("КонПериода",КонецДня(КонПериода));
        ТЗ_Дни = Получить_ТЗ_Дни(НачПериода,КонПериода);
        Запрос.УстановитьПараметр("ТЗ_Дни",ТЗ_Дни);
        
        ТЗ_Об = Запрос.Выполнить().Выгрузить();
		Возврат ТЗ_Об;
КонецФункции
